app/controllers/payments_controller.rb

SELECT "payments".* FROM "payments" ORDER BY user_id
SELECT "users".* FROM "users" WHERE "users"."id" = 161 LIMIT 1
---
  def index
    @payments = Payment.find(:all)
    @grouped = @payments.group_by(&:user_id)
    @user=User.find(:all)